Floater/background/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sidePatch
    {
        type            slip;
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ground
    {
        type            slip;
    }
    surround
    {
        patchType       overset;
        type            zeroGradient;
    }

    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }
    
    platform
    {
        type            calculated;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
