Floater/background/0.orig/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    sidePatch
    {
        type            slip;
    }
    top
    {
        type            zeroGradient;
    }
    ground
    {
        type            slip;
    }
    surround
    {
        patchType       overset;
        type            zeroGradient;

    }
    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;

    }
    platform
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
