Floater/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicOversetFvMesh;

solvers
{
    cube
    {
        motionSolverLibs   (sixDoFRigidBodyMotion);
        motionSolver        sixDoFRigidBodyMotion;

        cellSet             c1;

        patches             (platform);
        innerDistance       1000.0;
        outerDistance       1001.0;

        centreOfMass        (2.5 0 -0.1409);
        momentOfInertia     (0.75534 0.82236 1.3612); 
        mass                12.919;
        report              on;
        accelerationRelaxation    0.6;
        accelerationDamping       1;

        solver
        {
            type Newmark;
        }

        constraints
        {

        yPlane
        {
        sixDoFRigidBodyMotionConstraint plane;
        normal          (0 1 0);
        centreOfMass    (2.5 0 -0.1409);
        }

        }
    }
    
}

// ************************************************************************* //
