Floater/background/system/topoSetDict.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c8;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            boxes ((0 -2 -0.12) (1.9 2 0.12) (1.9 -2 -0.5) (3.3 2 0.4) (3.3 -2 -0.12) (20 2 0.12));
        }
    }
);

// ************************************************************************* //
